Revit 2024 API
PlanCircuit.GetPointInside Method
Returns a point inside the circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public UV GetPointInside()
Visual Basic
Public Function GetPointInside As UV
Visual C++
public:
UV^ GetPointInside()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when a valid UV point couldn't be obtained.
See Also
PlanCircuit Class
Autodesk.Revit.DB Namespace